/*
  Напиши функцию filterFromArray(arr), которая 
  объявляет 1 параметр, исходный массив arr.
  
  При вызове функции, первым аргументом всегда будет массив чисел,
  за которым следуют один или несколько аргументов, тоже чисел. 
  
  Функция возвращает новый массив, который содержит только 
  те элементы исходного массива, которые не совпадают 
  ни с одним из числовых аргументов.
*/
const filterFromArray = function(){
  let repeat = []; // повторювані
  let result = []; // результат
  
  function processing(num){ // функція для обробки числа
    repeatIndex = repeat.indexOf(num); // індекс числа в масиві повторюваних
    resultIndex = result.indexOf(num); // індекс числа в масиві результатів
    notInRepeat = repeatIndex == -1; // true якщо числа в масиві повторюваних нема
    notInResult = resultIndex == -1; // true якщо числа в масиві результатів нема
    if (notInRepeat && notInResult){ // перевірка на нове число, чи нема його в жодному з масивів
      result.push(num); // добавляємо число в результат
      //console.log("add", num);
      return; // закінчуємо подальшу обробку
    } else if (notInRepeat){ // якщо число не нове і його нема в повторюваних
      //console.log("sub", num);
      repeat.push(num); // додаємо в повторявані
      result.splice(resultIndex, 1); // видаляєм з результату
    } // тобто всі числа будуть в масиві результатів, але якщо воно вже зустрічалось то воно буде в масиві повторюваних, як би в чорному списку
  };
  
  Array.from(arguments).forEach((arg)=>{ // перетворюємо вхідні аргументи функції в масив і виконуємо цикл для кожного елемента
    if (Array.isArray(arg)){ // якщо агрумент масив
      arg.forEach(processing); // то приміняєм для кожного його елемента функцію обробки
    } else {
      processing(arg); // якщи число, то до нього приміняєм  функцію обробки
    }
  });
  return result;
}
// Вызовы функции для проверки
console.log(
  filterFromArray([1, 2, 3, 4, 5], 2, 4)
); 

console.log(
  filterFromArray([12, 4, 3, 8, 17], 3, 29, 18, 4)
); 